In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv("data_1.csv")

In [3]:
data

  name  age state  num_children  num_pets
0   달문   23    분당             2         0
1   메리   78    안양             2         4
2   피터   22    수원             0         0
3   제프   19    서울             1         5
4    빌   45    인천             2         0
5   리사   33    안산             1         0

# 인덱싱 처리시 하나의 칼럼을 읽을 때 데이터프레임이나 시리즈로 결과가 나오는 경우 비교하기

### 칼럼을 하나를 가져오지만 팬시 인덱싱은 데이터프레임으로 결과를 준다

In [4]:
data[["age"]]

   age
0   23
1   78
2   22
3   19
4   45
5   33

### 문자열로 넣고 인덱싱 처리할 때는 칼럼을 읽고 시리즈로 결과를 준다.

In [5]:
data["age"]

0    23
1    78
2    22
3    19
4    45
5    33
Name: age, dtype: int64

## 칼럼 내부의 값 변경하기

In [6]:
data[["age"]].apply(lambda value: value*2)

   age
0   46
1  156
2   44
3   38
4   90
5   66

## 시리즈로 처리해서 apply 처리하기

In [36]:
data['age'].map(lambda value: value*2)

0     46
1    156
2     44
3     38
4     90
5     66
Name: age, dtype: int64